In [1]:
%load_ext sql

In [2]:
%sql postgresql://localhost/sparkifydb

In [3]:
%sql SELECT * FROM fact_song_plays LIMIT 5;

 * postgresql://localhost/sparkifydb
1 rows affected.

[(1, 15, 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', datetime.datetime(2018, 11, 21, 15, 56, 47, 796000), None, 'paid', 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM dim_users LIMIT 5;

 * postgresql://localhost/sparkifydb
5 rows affected.

[(72, 'Hayden', 'Brock', 'F', 'paid'),
 (36, 'Matthew', 'Jones', 'M', 'paid'),
 (6, 'Cecilia', 'Owens', 'F', 'free'),
 (96, 'Cierra', 'Finley', 'F', 'free'),
 (71, 'Ayleen', 'Wise', 'F', 'free')]

In [5]:
%sql SELECT * FROM dim_songs LIMIT 5;

 * postgresql://localhost/sparkifydb
5 rows affected.

[('SONHOTT12A8C13493C', 'AR7G5I41187FB4CE6C', 'Something Girls', 1982, 233.40363),
 ('SOIAZJW12AB01853F1', 'AR8ZCNI1187B9A069B', 'Pink World', 1984, 269.81832),
 ('SOFSOCN12A8C143F5D', 'ARXR32B1187FB57099', 'Face the Ashes', 2007, 209.60608),
 ('SOHKNRJ12A6701D1F8', 'AR10USD1187B99F3F1', 'Drop of Rain', 0, 189.57016),
 ('SOQHXMF12AB0182363', 'ARGSJW91187B9B1D6B', 'Young Boy Blues', 0, 218.77506)]

In [6]:
%sql SELECT * FROM dim_artists LIMIT 5;

 * postgresql://localhost/sparkifydb
5 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', None, None),
 ('AR8ZCNI1187B9A069B', 'Planet P Project', '', None, None),
 ('ARXR32B1187FB57099', 'Gob', '', None, None),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', None, None),
 ('ARGSJW91187B9B1D6B', 'JennyAnyKind', 'North Carolina', '35.21962', '-80.01955')]

In [7]:
%sql SELECT * FROM dim_time LIMIT 5;

 * postgresql://localhost/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 10, 20, 33, 56, 796000), 20, 10, 45, 11, 2018, 5),
 (datetime.datetime(2018, 11, 10, 20, 36, 10, 796000), 20, 10, 45, 11, 2018, 5),
 (datetime.datetime(2018, 11, 10, 20, 40, 34, 796000), 20, 10, 45, 11, 2018, 5),
 (datetime.datetime(2018, 11, 10, 22, 36, 13, 796000), 22, 10, 45, 11, 2018, 5),
 (datetime.datetime(2018, 11, 10, 22, 36, 46, 796000), 22, 10, 45, 11, 2018, 5)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).